let defaultMachine = {
  current_State: {
    name: "Start",
    key: -1,
  },
  prev_State: {
    name: "none",
    key: 0,
  },
  input_String: '',
  StateMetrix: {
    Start: {
      name: "Start",
      ข้าว: "ข้าว",
      มาม่า: "มาม่า",
      หมูตุ๋น: "Start",
      เนื้อตุ๋น: "Start",
      ผัดกะเพรา: "Start",
      ผัดผงกะหรี่: "Start",
      Confirm: "Start",
      
      key: -1,
    },
    ข้าว: {
      name: "ข้าว",
      ข้าว: "ข้าว",
      มาม่า: "มาม่า",
      หมูตุ๋น: "ข้าวหมูตุ๋น",
      เนื้อตุ๋น: "ข้าวเนื้อตุ๋น",
      ผัดกะเพรา: "ข้าว",
      ผัดผงกะหรี่: "ข้าว",
      Confirm: "ข้าว",
      
      key: -3,
    },
    มาม่า: {
      name: "มาม่า",
      ข้าว: "ข้าว",
      มาม่า: "มาม่า",
      หมูตุ๋น: "มาม่าหมูตุ๋น",
      เนื้อตุ๋น: "มาม่าเนื้อตุ๋น",
      ผัดกะเพรา: "มาม่า",
      ผัดผงกะหรี่: "มาม่า",
      Confirm: "มาม่า",
      
      key: -4,
    },
    ข้าวหมูตุ๋น: {
      name: "ข้าวหมูตุ๋น",
      ข้าว: "ข้าวหมูตุ๋น",
      มาม่า: "มาม่าหมูตุ๋น",
      หมูตุ๋น: "ข้าว",
      เนื้อตุ๋น: "ข้าวเนื้อตุ๋น",
      ผัดกะเพรา: "ข้าวผัดกะเพราหมูตุ๋น",
      ผัดผงกะหรี่: "ข้าวผัดผงกะหรี่หมูตุ๋น",
      Confirm: "ข้าวหมูตุ๋น",
      
      key: -6,
    },
    ข้าวเนื้อตุ๋น: {
      name: "ข้าวเนื้อตุ๋น",
      ข้าว: "ข้าวเนื้อตุ๋น",
      มาม่า: "มาม่าเนื้อตุ๋น",
      หมูตุ๋น: "ข้าวหมูตุ๋น",
      เนื้อตุ๋น: "ข้าว",
      ผัดกะเพรา: "ข้าวผัดกะเพราเนื้อตุ๋น",
      ผัดผงกะหรี่: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      Confirm: "ข้าวเนื้อตุ๋น",
      
      key: -5,
    },
    มาม่าหมูตุ๋น: {
      name: "มาม่าหมูตุ๋น",
      ข้าว: "ข้าวหมูตุ๋น",
      มาม่า: "มาม่าหมูตุ๋น",
      หมูตุ๋น: "มาม่า",
      เนื้อตุ๋น: "มาม่าเนื้อตุ๋น",
      ผัดกะเพรา: "มาม่าผัดกะเพราหมูตุ๋น",
      ผัดผงกะหรี่: "มาม่าผัดผงกะหรี่หมูตุ๋น",
      Confirm: "มาม่าหมูตุ๋น",
      
      key: -7,
    },
    มาม่าเนื้อตุ๋น: {
      name: "มาม่าเนื้อตุ๋น",
      ข้าว: "ข้าวเนื้อตุ๋น",
      มาม่า: "มาม่าเนื้อตุ๋น",
      หมูตุ๋น: "มาม่าหมูตุ๋น",
      เนื้อตุ๋น: "มาม่า",
      ผัดกะเพรา: "มาม่าผัดกะเพราเนื้อตุ๋น",
      ผัดผงกะหรี่: "มาม่าผัดผงกะหรี่เนื้อตุ๋น",
      Confirm: "มาม่าเนื้อตุ๋น",
      
      key: -8,
    },
    ข้าวผัดกะเพราหมูตุ๋น: {
      name: "ข้าวผัดกะเพราหมูตุ๋น",
      ข้าว: "ข้าวผัดกะเพราหมูตุ๋น",
      มาม่า: "มาม่าผัดกะเพราหมูตุ๋น",
      หมูตุ๋น: "ข้าวผัดกะเพราหมูตุ๋น",
      เนื้อตุ๋น: "ข้าวผัดกะเพราเนื้อตุ๋น",
      ผัดกะเพรา: "ข้าวหมูตุ๋น",
      ผัดผงกะหรี่: "ข้าวผัดผงกะหรี่หมูตุ๋น",
      Confirm: "Confirm",
      
      key: -9,
    },
    ข้าวผัดผงกะหรี่หมูตุ๋น: {
      name: "ข้าวผัดผงกะหรี่หมูตุ๋น",
      ข้าว: "ข้าวผัดผงกะหรี่หมูตุ๋น",
      มาม่า: "มาม่าผัดผงกะหรี่หมูตุ๋น",
      หมูตุ๋น: "ข้าวผัดผงกะหรี่หมูตุ๋น",
      เนื้อตุ๋น: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      ผัดกะเพรา: "ข้าวผัดกะเพราหมูตุ๋น",
      ผัดผงกะหรี่: "ข้าวหมูตุ๋น",
      Confirm: "Confirm",
      
      key: -10,
    },
    มาม่าผัดกะเพราหมูตุ๋น: {
      name: "มาม่าผัดกะเพราหมูตุ๋น",
      ข้าว: "ข้าวผัดกะเพราหมูตุ๋น",
      มาม่า: "มาม่าผัดกะเพราหมูตุ๋น",
      หมูตุ๋น: "มาม่าผัดกะเพราหมูตุ๋น",
      เนื้อตุ๋น: "มาม่าผัดกะเพราเนื้อตุ๋น",
      ผัดกะเพรา: "มาม่าหมูตุ๋น",
      ผัดผงกะหรี่: "มาม่าผัดผงกะหรี่หมูตุ๋น",
      Confirm: "Confirm",
      
      key: -16,
    },
    มาม่าผัดผงกะหรี่หมูตุ๋น: {
      name: "มาม่าผัดผงกะหรี่หมูตุ๋น",
      ข้าว: "ข้าวผัดผงกะหรี่หมูตุ๋น",
      มาม่า: "มาม่าผัดผงกะหรี่หมูตุ๋น",
      หมูตุ๋น: "มาม่าผัดผงกะหรี่หมูตุ๋น",
      เนื้อตุ๋น: "มาม่าผัดผงกะหรี่เนื้อตุ๋น",
      ผัดกะเพรา: "มาม่าผัดกะเพราหมูตุ๋น",
      ผัดผงกะหรี่: "มาม่าหมูตุ๋น",
      Confirm: "Confirm",
      
      key: -15,
    },
    ข้าวผัดผงกะหรี่เนื้อตุ๋น: {
      name: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      ข้าว: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      มาม่า: "มาม่าผัดผงกะหรี่เนื้อตุ๋น",
      หมูตุ๋น: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      เนื้อตุ๋น: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      ผัดกะเพรา: "ข้าวผัดกะเพราเนื้อตุ๋น",
      ผัดผงกะหรี่: "ข้าวเนื้อตุ๋น",
      Confirm: "Confirm",
      
      key: -13,
    },
    ข้าวผัดกะเพราเนื้อตุ๋น: {
      name: "ข้าวผัดกะเพราเนื้อตุ๋น",
      ข้าว: "ข้าวผัดกะเพราเนื้อตุ๋น",
      มาม่า: "มาม่าผัดกะเพราเนื้อตุ๋น",
      หมูตุ๋น: "ข้าวผัดกะเพราหมูตุ๋น",
      เนื้อตุ๋น: "ข้าวผัดกะเพราเนื้อตุ๋น",
      ผัดกะเพรา: "ข้าวเนื้อตุ๋น",
      ผัดผงกะหรี่: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      Confirm: "Confirm",
      
      key: -14,
    },
    มาม่าผัดผงกะหรี่เนื้อตุ๋น: {
      name: "มาม่าผัดผงกะหรี่เนื้อตุ๋น",
      ข้าว: "ข้าวผัดผงกะหรี่เนื้อตุ๋น",
      มาม่า: "มาม่าผัดผงกะหรี่เนื้อตุ๋น",
      หมูตุ๋น: "มาม่าผัดผงกะหรี่หมูตุ๋น",
      เนื้อตุ๋น: "มาม่าผัดผงกะหรี่เนื้อตุ๋น",
      ผัดกะเพรา: "มาม่าผัดกะเพราเนื้อตุ๋น",
      ผัดผงกะหรี่: "มาม่าเนื้อตุ๋น",
      Confirm: "Confirm",
      
      key: -12,
    },
    มาม่าผัดกะเพราเนื้อตุ๋น: {
      name: "มาม่าผัดกะเพราเนื้อตุ๋น",
      ข้าว: "ข้าวผัดกะเพราเนื้อตุ๋น",
      มาม่า: "มาม่าผัดกะเพราเนื้อตุ๋น",
      หมูตุ๋น: "มาม่าผัดกะเพราหมูตุ๋น",
      เนื้อตุ๋น: "มาม่าผัดกะเพราเนื้อตุ๋น",
      ผัดกะเพรา: "มาม่าเนื้อตุ๋น",
      ผัดผงกะหรี่: "มาม่าผัดผงกะหรี่เนื้อตุ๋น",
      Confirm: "Confirm",
      
      key: -11,
    },
    Confirm: {
      name: "Confirm",
      ข้าว: "Confirm",
      มาม่า: "Confirm",
      หมูตุ๋น: "Confirm",
      เนื้อตุ๋น: "Confirm",
      ผัดกะเพรา: "Confirm",
      ผัดผงกะหรี่: "Confirm",
      Confirm: "Confirm",
      
      key: -2,
    },
    Trape_state: {
      name: "Trape_state",
      ข้าว: "Trape_state",
      มาม่า: "Trape_state",
      หมูตุ๋น: "Trape_state",
      เนื้อตุ๋น: "Trape_state",
      ผัดกะเพรา: "Trape_state",
      ผัดผงกะหรี่: "Trape_state",
      Confirm: "Trape_state",
      
      key: 1,
    },
  },
  getNext: function (taget) {
    let next = this.StateMetrix[this.current_State.name][taget];
    return { name: next, key: this.StateMetrix[next].key };
  },
  setCurrentState: function (next) {
    this.current_State = next;
  },
};

export default defaultMachine